[
  {
    "title": "1984",
    "summary": "A dystopian story about a totalitarian society controlled by surveillance and propaganda. Winston Smith, the protagonist, rebels against the system in search of truth and freedom. The novel explores themes of control, truth, and individuality."
  },
  {
    "title": "The Hobbit",
    "summary": "Bilbo Baggins, a hobbit, is swept into an epic quest to reclaim a lost dwarven kingdom from the dragon Smaug. Along the way, he encounters trolls, elves, goblins, and a mysterious ring. Themes include friendship, adventure, and courage."
  },
  {
    "title": "To Kill a Mockingbird",
    "summary": "Set in the American South, this novel follows Scout Finch as her father Atticus defends a black man falsely accused of rape. It deals with racism, morality, and growing up with integrity and empathy."
  },
  {
    "title": "The Great Gatsby",
    "summary": "Jay Gatsby’s obsession with Daisy Buchanan leads to tragedy in this story of wealth, love, and the American Dream. Set in the 1920s, it critiques materialism and lost ideals."
  },
  {
    "title": "Brave New World",
    "summary": "A futuristic society thrives on conformity and artificial happiness through genetic engineering and drugs. Bernard Marx begins to question this superficial paradise. Themes include freedom, control, and individuality."
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "summary": "Harry discovers he’s a wizard and attends Hogwarts, where he finds friendship and battles evil. His journey uncovers secrets about his past. Key themes are friendship, magic, and self-discovery."
  },
  {
    "title": "The Catcher in the Rye",
    "summary": "Holden Caulfield narrates his disillusionment with the adult world after being expelled from prep school. A story about identity, loneliness, and teenage rebellion."
  },
  {
    "title": "The Lord of the Rings",
    "summary": "Frodo and his friends embark on a perilous journey to destroy the One Ring and defeat Sauron. It’s an epic tale of friendship, sacrifice, and good vs. evil."
  },
  {
    "title": "Pride and Prejudice",
    "summary": "Elizabeth Bennet navigates societal expectations and love as she spars with the proud Mr. Darcy. The novel explores class, marriage, and personal growth."
  },
  {
    "title": "Animal Farm",
    "summary": "Farm animals overthrow their human owner and attempt to create an equal society, only to be manipulated by the pigs. An allegory about power, corruption, and betrayal."
  }
]
